#!/usr/bin/env bash

should_brew_tap() {
  ! brew tap | grep "$1" >/dev/null
}

should_brew_install_cask() {
  ! brew list --cask | grep "$1" >/dev/null
}

should_mas_install() {
  ! mas list | grep "$1" >/dev/null
}

if should_brew_tap homebrew/cask
then
  brew tap homebrew/cask
fi

if should_brew_install_cask arc
then
  brew install --cask arc
fi

if should_brew_install_cask firefox
then
  brew install --cask firefox
fi

if should_brew_install_cask tunnelblick
then
  brew install --cask tunnelblick
fi

if should_brew_install_cask visual-studio-code
then
  brew install --cask visual-studio-code

  read -s -p "To continue, you need to open Visual Studio Code.app manually. Press RETURN if you are done."; echo

  ln -sf "$DOTFILES/.config/vscode/settings.json" "$HOME/Library/Application Support/Code/User/settings.json"
  ln -sf "$DOTFILES/.config/vscode/keybindings.json" "$HOME/Library/Application Support/Code/User/keybindings.json"

  code --install-extension wmaurer.change-case
  code --install-extension streetsidesoftware.code-spell-checker
  code --install-extension pawelgrzybek.gatito-theme
  code --install-extension esbenp.prettier-vscode
  code --install-extension jasonnutter.search-node-modules
  code --install-extension CodeQue.codeque
  code --install-extension dbaeumer.vscode-eslint
  code --install-extension yoavbls.pretty-ts-errors
  code --install-extension Cardinal90.multi-cursor-case-preserve
  code --install-extension golang.go
  code --install-extension rust-lang.rust-analyzer

  ln -sf "$DOTFILES/.config/quokka" "$HOME/.quokka"

  code --install-extension WallabyJs.quokka-vscode
fi

if should_brew_install_cask sublime-merge
then
  brew install --cask sublime-merge

  read -s -p "To continue, you need to open Sublime Merge.app manually. Press RETURN if you are done."; echo

  ln -sf "$DOTFILES/.config/smerge/Preferences.sublime-settings" "$HOME/Library/Application Support/Sublime Merge/Packages/User/Preferences.sublime-settings"
fi

if should_brew_install_cask iterm2
then
  brew install --cask iterm2
fi

if should_brew_install_cask telegram
then
  brew install --cask telegram
fi

if should_brew_install_cask iina
then
  brew install --cask iina
fi

if should_brew_install_cask bitwarden
then
  brew install --cask bitwarden
fi

if should_brew_install_cask dash
then
  brew install --cask dash
fi

if should_brew_install_cask obsidian
then
  brew install --cask obsidian
fi

if should_brew_install_cask maccy
then
  brew install --cask maccy

  defaults write org.p0deje.Maccy KeyboardShortcuts_popup -string "{\"carbonModifiers\":768,\"carbonKeyCode\":9}"
  defaults write org.p0deje.Maccy hideFooter -bool true
  defaults write org.p0deje.Maccy hideTitle -bool true
  defaults write org.p0deje.Maccy pasteByDefault -bool true
  defaults write org.p0deje.Maccy supressClearAlert -bool true
  defaults write org.p0deje.Maccy showInStatusBar -bool false
  defaults write org.p0deje.Maccy popupPosition -string "center"
  defaults write org.p0deje.Maccy historySize -int 10
  defaults write org.p0deje.Maccy ignoredApps -array "com.bitwarden.desktop"
fi

# Reeder 5
if should_mas_install 1529448980
then
  mas install 1529448980
fi
