#!/usr/bin/env bash

should_brew_install_cask() {
  ! brew list --cask | grep "$1" >/dev/null
}

if should_brew_install_cask zed
then
  brew install --cask zed

  mkdir -p "$HOME/.config/zed"

  ln -sf "$DOTFILES/.config/zed/settings.json" "$HOME/.config/zed/settings.json"
  ln -sf "$DOTFILES/.config/zed/keymap.json" "$HOME/.config/zed/keymap.json"
  ln -sf "$DOTFILES/.config/zed/tasks.json" "$HOME/.config/zed/tasks.json"

  mkdir -p "$HOME/.config/zed/snippets"

  ln -sf "$DOTFILES/.config/zed/snippets/javascript.json" "$HOME/.config/zed/snippets/javascript.json"
  ln -sf "$DOTFILES/.config/zed/snippets/typescript.json" "$HOME/.config/zed/snippets/typescript.json"

  mkdir -p "$HOME/.claude"

  ln -sf "$DOTFILES/.config/claude/settings.json" "$HOME/.claude/settings.json"
fi

if should_brew_install_cask sublime-merge
then
  brew install --cask sublime-merge

  read -s -p "To continue, you need to open Sublime Merge.app manually. Press RETURN if you are done."; echo

  ln -sf "$DOTFILES/.config/smerge/Preferences.sublime-settings" "$HOME/Library/Application Support/Sublime Merge/Packages/User/Preferences.sublime-settings"
fi

if should_brew_install_cask telegram
then
  brew install --cask telegram
fi

if should_brew_install_cask iina
then
  brew install --cask iina
fi

if should_brew_install_cask bitwarden
then
  brew install --cask bitwarden
fi

if should_brew_install_cask obsidian
then
  brew install --cask obsidian
fi

if should_brew_install_cask maccy
then
  brew install --cask maccy

  defaults write org.p0deje.Maccy KeyboardShortcuts_popup -string "{\"carbonModifiers\":768,\"carbonKeyCode\":9}"
  defaults write org.p0deje.Maccy hideFooter -bool true
  defaults write org.p0deje.Maccy hideTitle -bool true
  defaults write org.p0deje.Maccy pasteByDefault -bool true
  defaults write org.p0deje.Maccy supressClearAlert -bool true
  defaults write org.p0deje.Maccy showInStatusBar -bool false
  defaults write org.p0deje.Maccy popupPosition -string "center"
  defaults write org.p0deje.Maccy historySize -int 10
  defaults write org.p0deje.Maccy ignoredApps -array "com.bitwarden.desktop"
fi

if should_brew_install_cask keyboardcleantool
then
  brew install --cask keyboardcleantool
fi

if should_brew_install_cask ghostty
then
  brew install --cask ghostty

  mkdir -p "$HOME/.config"

  ln -sf "$DOTFILES/.config/ghostty" "$HOME/.config/ghostty"
fi

if should_brew_install_cask font-maple-mono
then
  brew install --cask font-maple-mono
fi

if should_brew_install_cask google-chrome
then
  brew install --cask google-chrome
fi
